; domain
(define (domain rover-minerales)
  (:requirements :typing :negative-preconditions)

  (:types
    localidad mineral rover - object
  )

  (:predicates
    (en-rover ?r - rover ?l - localidad)        ; el rover está en localidad l
    (en-mineral ?m - mineral ?l - localidad)    ; el mineral m está en localidad l
    (transportando ?r - rover ?m - mineral)     ; el rover lleva el mineral m
    (laboratorio ?l - localidad)                ; localidad l tiene laboratorio
    (analizado ?m - mineral)                    ; el mineral m ya fue analizado
    (camino ?l1 - localidad ?l2 - localidad)    ; existe camino de l1 a l2
    (manos-libres ?r - rover)                   ; el rover no carga nada
  )

  ; ------------------------------------------------------------------
  ; ACCIÓN: Mover el rover de una localidad a otra
  ; ------------------------------------------------------------------
  (:action mover
    :parameters (?r - rover ?desde - localidad ?hacia - localidad)
    :precondition (and
      (en-rover ?r ?desde)
      (camino ?desde ?hacia)
    )
    :effect (and
      (not (en-rover ?r ?desde))
      (en-rover ?r ?hacia)
    )
  )

  ; ------------------------------------------------------------------
  ; ACCIÓN: Recoger un mineral en la localidad donde está el rover
  ; ------------------------------------------------------------------
  (:action recoger
    :parameters (?r - rover ?m - mineral ?l - localidad)
    :precondition (and
      (en-rover ?r ?l)
      (en-mineral ?m ?l)
      (manos-libres ?r)
    )
    :effect (and
      (transportando ?r ?m)
      (not (en-mineral ?m ?l))
      (not (manos-libres ?r))
    )
  )

  ; ------------------------------------------------------------------
  ; ACCIÓN: Entregar mineral en el laboratorio
  ; ------------------------------------------------------------------
  (:action entregar
    :parameters (?r - rover ?m - mineral ?l - localidad)
    :precondition (and
      (en-rover ?r ?l)
      (transportando ?r ?m)
      (laboratorio ?l)
    )
    :effect (and
      (not (transportando ?r ?m))
      (manos-libres ?r)
      (analizado ?m)
    )
  )
)

; problem
(define (problem rover-problema2)
  (:domain rover-minerales)

  (:objects
    rover1 - rover
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 - localidad
    mineral1 mineral2 mineral3 - mineral
  )

  (:init
    ; Posición inicial del rover
    (en-rover rover1 loc3)
    (manos-libres rover1)

    ; Minerales excavados
    (en-mineral mineral1 loc1)
    (en-mineral mineral2 loc2)
    (en-mineral mineral3 loc6)

    ; Laboratorios
    (laboratorio loc5)
    (laboratorio loc7)

    ; Red de caminos (original)
    (camino loc3 loc1)
    (camino loc1 loc3)
    (camino loc3 loc2)
    (camino loc2 loc4)
    (camino loc3 loc4)
    (camino loc4 loc3)
    (camino loc4 loc5)
    (camino loc5 loc4)

    ; Nuevas conexiones
    (camino loc5 loc6)    ; una sola dirección
    (camino loc6 loc7)    ; bidireccional
    (camino loc7 loc6)
  )

  (:goal
    (and
      (analizado mineral1)
      (analizado mineral2)
      (analizado mineral3)
    )
  )
)

; plan
1. (mover rover1 loc3 loc2)
   deleted: (en-rover rover1 loc3)
   added: (en-rover rover1 loc2)
   goals met: 0 of 3
2. (recoger rover1 mineral2 loc2)
   deleted: (en-mineral mineral2 loc2) (manos-libres rover1)
   added: (transportando rover1 mineral2)
   goals met: 0 of 3
3. (mover rover1 loc2 loc4)
   deleted: (en-rover rover1 loc2)
   added: (en-rover rover1 loc4)
   goals met: 0 of 3
4. (mover rover1 loc4 loc5)
   deleted: (en-rover rover1 loc4)
   added: (en-rover rover1 loc5)
   goals met: 0 of 3
5. (entregar rover1 mineral2 loc5)
   deleted: (transportando rover1 mineral2)
   added: (manos-libres rover1) (analizado mineral2)
   goals met: 1 of 3
6. (mover rover1 loc5 loc4)
   deleted: (en-rover rover1 loc5)
   added: (en-rover rover1 loc4)
   goals met: 1 of 3
7. (mover rover1 loc4 loc3)
   deleted: (en-rover rover1 loc4)
   added: (en-rover rover1 loc3)
   goals met: 1 of 3
8. (mover rover1 loc3 loc1)
   deleted: (en-rover rover1 loc3)
   added: (en-rover rover1 loc1)
   goals met: 1 of 3
9. (recoger rover1 mineral1 loc1)
   deleted: (en-mineral mineral1 loc1) (manos-libres rover1)
   added: (transportando rover1 mineral1)
   goals met: 1 of 3
10. (mover rover1 loc1 loc3)
   deleted: (en-rover rover1 loc1)
   added: (en-rover rover1 loc3)
   goals met: 1 of 3
11. (mover rover1 loc3 loc4)
   deleted: (en-rover rover1 loc3)
   added: (en-rover rover1 loc4)
   goals met: 1 of 3
12. (mover rover1 loc4 loc5)
   deleted: (en-rover rover1 loc4)
   added: (en-rover rover1 loc5)
   goals met: 1 of 3
13. (entregar rover1 mineral1 loc5)
   deleted: (transportando rover1 mineral1)
   added: (manos-libres rover1) (analizado mineral1)
   goals met: 2 of 3
14. (mover rover1 loc5 loc6)
   deleted: (en-rover rover1 loc5)
   added: (en-rover rover1 loc6)
   goals met: 2 of 3
15. (recoger rover1 mineral3 loc6)
   deleted: (en-mineral mineral3 loc6) (manos-libres rover1)
   added: (transportando rover1 mineral3)
   goals met: 2 of 3
16. (mover rover1 loc6 loc7)
   deleted: (en-rover rover1 loc6)
   added: (en-rover rover1 loc7)
   goals met: 2 of 3
17. (entregar rover1 mineral3 loc7)
   deleted: (transportando rover1 mineral3)
   added: (manos-libres rover1) (analizado mineral3)
   goals met: 3 of 3
